Tekla.Structures.Dialog.FormBorders
The FormBorders class handles the storing and restoring of the form size and location.

Tekla.Structures.Dialog.FormBorders.StoreFormSizeAndLocation(System.Windows.Forms.Form)
Stores the form size and location into the registry.
form: The form in question.

Tekla.Structures.Dialog.FormBorders.StoreFormSizeAndLocation(System.Windows.Window)
Stores the window size and location into the registry.
window: The form in question.

Tekla.Structures.Dialog.FormBorders.RestoreFormSizeAndLocation(System.Windows.Forms.Form)
Restores the form size and location from the registry.
form: The form in question.

Tekla.Structures.Dialog.FormBorders.CheckScreenPosition(System.Windows.Forms.Form)
Moves form to primary screen.
form: The form in question.

Tekla.Structures.Dialog.FormBorders.IsOnActiveDisplays(System.Windows.Forms.Form)
Checks form quadrants to be sure full extents is on a single screen
Returns: True if fully contained in a screen
form: The form in question.

Tekla.Structures.Dialog.FormBorders.RestoreFormSizeAndLocation(System.Windows.Window)
Restores the WPF window size and location from the registry.
window: The form in question.

Tekla.Structures.Dialog.FormBorders.CheckScreenPosition(System.Windows.Window)
Moves window to primary screen.
window: The window in question.

Tekla.Structures.Dialog.FormBorders.IsOnActiveDisplays(System.Windows.Window)
Checks form quadrants to be sure full extents is on a single screen
Returns: True if fully contained in a screen

Tekla.Structures.Dialog.FormBorders.ConvertPt(System.Windows.Point)
Converts to Drawing point type
pt: Windows point to convert
Returns: New Drawing point with x and y value from argument values